class RobotAPI():   
    def __init__(self): 
        ##############################################################
        # クラス変数定義
        ##############################################################  
        # シーケンス作成用
        self.arrived = False
        
    def __del__(self):
        ##############################################################
        # 
        ##############################################################  
        pass

    def moveAbsoluteLine(self, x, y, z, rx, ry, rz, vel, acc, dec) -> int:
        self.arrived = True
        print("Done!!!")